bit-finance/Catalogs/бит_Бюджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_Бюджеты</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Код, предназначенный для вывода в отчеты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_ТипыБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыБюджетов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БДР</Name>
					<Comment>БДР</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БДДС</Name>
					<Comment>БДДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>Прочие</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСтатейОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСтатейОборотов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БДДС</Name>
					<Comment>Статья БДДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БДР</Name>
					<Comment>Статья БДР</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НефинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочая статья</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_РасходДоход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РасходДоход</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расходование</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТекстКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_Бюджеты/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоНовый() И Не ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(ТипБюджета) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru='Тип бюджета';en='Budget Type'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ТипБюджета", "Объект", Отказ);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	Справочники.бит_Бюджеты.ОбработатьБюджетЗапрещенКПланированию(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет статьи бюджета по группе статей оборотов.
// 
// Параметры:
//  ВерхняяГруппа  - СправочникСсылка.бит_СтатьиОборотов.
//  Бюджет         - СправочникСсылка.бит_Бюджеты.
//  РодительПоУмолчанию - СправочникСсылка.бит_СтатьиБюджета.
//  Коэффициент         - Число.
//  ВыполнятьВТранзакции- Булево.
// 
Процедура ЗаполнитьПоСтатьеОборотов(ВерхняяГруппа, Бюджет, РодительПоУмолчанию, Коэффициент, ВыполнятьВТранзакции)  Экспорт

	Если Бюджет.ТипБюджета = Перечисления.бит_ТипыБюджетов.БДДС Тогда
		ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДДС;
	ИначеЕсли Бюджет.ТипБюджета = Перечисления.бит_ТипыБюджетов.БДР Тогда
		ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДР;
	Иначе	
		ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.ПустаяСсылка();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РодительПоУмолчанию"	,РодительПоУмолчанию);
	Запрос.УстановитьПараметр("ВерхняяГруппа"      	,ВерхняяГруппа);
	Запрос.УстановитьПараметр("ТипСтатьи"			,ТипСтатьи);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	бит_СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа,
	|	бит_СтатьиОборотов.Наименование КАК Наименование,
	|	бит_СтатьиОборотов.Кодификатор КАК Кодификатор,
	|	бит_СтатьиОборотов.НаименованиеПолное КАК НаименованиеПолное,
	|	&РодительПоУмолчанию КАК Приемник
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&ВерхняяГруппа)
	|	И бит_СтатьиОборотов.ЭтоГруппа = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.бит_ТипыСтатейОборотов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ бит_СтатьиОборотов.ТипСтатьи = &ТипСтатьи
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка,
	|	бит_СтатьиОборотов.ЭтоГруппа,
	|	бит_СтатьиОборотов.Наименование,
	|	бит_СтатьиОборотов.Кодификатор,
	|	бит_СтатьиОборотов.НаименованиеПолное,
	|	&РодительПоУмолчанию
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&ВерхняяГруппа)
	|	И бит_СтатьиОборотов.ЭтоГруппа = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
				   
    Результат = Запрос.Выполнить();
	ДеревоРезультат = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию()
	КонецЕсли; 
	
	Попытка
		ОбойтиИерархиюСтатейОборотов(ДеревоРезультат,Бюджет,Коэффициент);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Заполнение завершено.';en='Filling in completed.'")); 
		Справочники.бит_Бюджеты.ОбработатьБюджетЗапрещенКПланированию(Бюджет);
		Если ВыполнятьВТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли; 
	Исключение
		Если ВыполнятьВТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выполнить заполнение по причине: %1';
									    |en='Unable to fill the following reason:%1'"),
								   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обходит дерево статей оборотов и создает статьи бюджета.
// Рекурсивный вызов.
// 
// Параметры:
//  СтрокаВерх  - СтрокаДереваЗначений.
//  Бюджет      - СправочникСсылка.бит_Бюджеты.
//  Коэффициент - Число.
// 
Процедура ОбойтиИерархиюСтатейОборотов(СтрокаВерх,Бюджет,Коэффициент)

	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		// Определим группу или элемент создавать
		Если СтрокаДерева.ЭтоГруппа Тогда
			// Изменение кода. Начало. 19.02.2015{{
			ЕстьЭлементы = Ложь;
			ПроверкаНаличияЭлементовУГруппы(СтрокаДерева, ЕстьЭлементы);
			Если НЕ ЕстьЭлементы Тогда
				Продолжить;
			КонецЕсли; 
			// Изменение кода. Конец. 19.02.2015}}
			СтатьяБюджета = Справочники.бит_СтатьиБюджета.СоздатьГруппу();
		Иначе
			СтатьяБюджета = Справочники.бит_СтатьиБюджета.СоздатьЭлемент();
			СтатьяБюджета.НаименованиеПолное = СтрокаДерева.НаименованиеПолное;
		КонецЕсли; 
		
		// Заполним реквизиты.
		СтатьяБюджета.Владелец       = Бюджет;
		СтатьяБюджета.СтатьяОборотов = СтрокаДерева.Ссылка;
		СтатьяБюджета.Наименование   = СокрЛП(СтрокаДерева.Наименование);
		СтатьяБюджета.Кодификатор    = СокрЛП(СтрокаДерева.Кодификатор);
		
		Если Коэффициент = 0 И Не СтрокаДерева.ЭтоГруппа Тогда
			СтатьяБюджета.Коэффициент = ?(СтатьяБюджета.СтатьяОборотов.РасходДоход = Перечисления.бит_РасходДоход.Расходование, -1, 1);
		Иначе	
			СтатьяБюджета.Коэффициент = Коэффициент;
		КонецЕсли;
						
		Если СтрокаДерева.Родитель <> Неопределено Тогда
		    // Родителя заполняем из верхней ветки дерева.
			Если ЗначениеЗаполнено(СтрокаДерева.Родитель.Приемник) 
				 И СтрокаДерева.Родитель.Приемник.ЭтоГруппа Тогда				
				СтатьяБюджета.Родитель = СтрокаДерева.Родитель.Приемник;				
			КонецЕсли; 
		Иначе
			// Если строка дерева не подчинена - то по умолчанию.
			СтатьяБюджета.Родитель = СтрокаДерева.Приемник;
		КонецЕсли; 
		
		СтатьяБюджета.УстановитьНовыйКод();
		СтатьяБюджета.ДополнительныеСвойства.Вставить("ЭтоКопирование", Истина);
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СтатьяБюджета, , "Все");
		Если ДействиеВыполнено Тогда
			
			// Если запись выполнена - запомним приемник для последующего заполнения иерархии.
			СтрокаДерева.Приемник = СтатьяБюджета.Ссылка;	
			
		КонецЕсли; 
		
		// Рекурсивный вызов.
		ОбойтиИерархиюСтатейОборотов(СтрокаДерева,Бюджет,Коэффициент);
		
	КонецЦикла; 

КонецПроцедуры

// Процедура проверяет наличие элементов у группы, вызывается рекурсивно.
// 
Процедура ПроверкаНаличияЭлементовУГруппы(СтрокаДерева, ЕстьЭлементы)

	Если СтрокаДерева.ЭтоГруппа И СтрокаДерева.Строки.Количество()>0 Тогда
	
		Для каждого Строка Из СтрокаДерева.Строки Цикл
		
			Если Строка.ЭтоГруппа Тогда
				
				// Рекурсивный вызов.
				ПроверкаНаличияЭлементовУГруппы(Строка, ЕстьЭлементы)
				
			Иначе	
				ЕстьЭлементы = Истина;
			КонецЕсли; 
		
		КонецЦикла; 
		
	Иначе	
		Возврат;
	КонецЕсли; 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = СтрШаблон(НСтр("ru='%1 (Копия)';en='%1 (Copy)'"), ОбъектКопирования.Наименование); 
	
	Кодификатор = "";
	
	Если ЗначениеЗаполнено(ОбъектКопирования.Родитель) Тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Родитель", ОбъектКопирования.Родитель);
	Иначе
		ДанныеЗаполнения = Неопределено;
	КонецЕсли;
	
	РегистрыСведений.бит_МаскиКодов.ЗаполнитьКодификаторДляЭлементаСправочника(ДанныеЗаполнения, Ссылка, Кодификатор);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
